entrevista.org
#+TITLE: Uma lista de perguntas para se fazer numa entrevista de emprego
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+OPTIONS: toc:nil num:nil H:4 ^:nil pri:t
#+OPTIONS: html-postamble:nil
#+AUTHOR: Rafael Castro
#+LANGUAGE: pt
#+EMAIL: rafaelcgs10@gmail.com

Algumas perguntas que podem ser boas de se fazer numa entrevista de emprego:

- Tem CI, CD?
- Qual é a stack (linguagens, frameworks, bibliotecas, infraestrutura)?
- Tem devops full time?
- Tem suporte (ao cliente) full time?
- Qual (aproximadamente) é porcentagem de cobertura dos testes nos projetos?
- Fazem postmortem de dos problemas?
- Tamanho do time(s)?
- Qntos seniors/plenos/dinossauros tem?
- Fazem code review? É obrigatorio?
- Tem tempo pago pra aprender?
- Tem home office / trabalho remoto?
- Como e com que frequência vocês adotam novas tecnologias?
- Com que frequência dívidas técnicas nos softwares são criadas e pagas?
- Como funciona o onboarding?
- O quão sistematicamente questões relacionadas a [[https://pt.wikipedia.org/wiki/Doutrina][doutrina]] da empresa são repetidas para os funcionários?
- O que pode fazer um funcionário ser demitido? Quais foram as causas mais comuns?
- Como é a cobrança sobre os funcionários?
- Como é funciona o aumento dos funcionários?
 - Vocês negocioam salário caso o funcionário receba uma outra proposta?
- De um ano para cá, quantos funcionários sairam e quantos entraram nesta empresa?
- Esta empresa dá lucro? Depende de investimento externo?
  
/Algumas/ destas perguntas foram roubas do [[https://h3nnn4n.me/][Renan]]!
