entrevista.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2020-02-13 Thu 14:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Perguntas para se fazer numa entrevista de emprego</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Perguntas para se fazer numa entrevista de emprego</h1>
<p>
Algumas perguntas que podem ser boas de se fazer numa entrevista de emprego:
</p>

<div id="outline-container-orgc1a07e9" class="outline-2">
<h2 id="orgc1a07e9">Tem CI, CD?</h2>
</div>
<div id="outline-container-orgeb75807" class="outline-2">
<h2 id="orgeb75807">Qual é a stack (linguagens, frameworks, bibliotecas, infraestrutura)?</h2>
</div>
<div id="outline-container-orgb162582" class="outline-2">
<h2 id="orgb162582">Tem devops full time?</h2>
</div>
<div id="outline-container-org2d3f387" class="outline-2">
<h2 id="org2d3f387">Tem suporte (ao cliente) full time?</h2>
</div>
<div id="outline-container-orgf26e859" class="outline-2">
<h2 id="orgf26e859">Qual (aproximadamente) é porcentagem de cobertura dos testes nos projetos?</h2>
</div>
<div id="outline-container-orge4e802d" class="outline-2">
<h2 id="orge4e802d">Fazem postmortem de dos problemas?</h2>
</div>
<div id="outline-container-org9367bc4" class="outline-2">
<h2 id="org9367bc4">Tamanho do time(s)?</h2>
</div>
<div id="outline-container-orgf0b84be" class="outline-2">
<h2 id="orgf0b84be">Qntos seniors/plenos/dinossauros tem?</h2>
</div>
<div id="outline-container-orgbf67903" class="outline-2">
<h2 id="orgbf67903">Fazem code review? É obrigatorio?</h2>
</div>
<div id="outline-container-orgf9d4e03" class="outline-2">
<h2 id="orgf9d4e03">Tem tempo pago pra aprender?</h2>
</div>
<div id="outline-container-org7562e41" class="outline-2">
<h2 id="org7562e41">Tem home office / trabalho remoto?</h2>
</div>
<div id="outline-container-orga4298ed" class="outline-2">
<h2 id="orga4298ed">Como e com que frequência vocês adotam novas tecnologias?</h2>
</div>
<div id="outline-container-orgb576a0f" class="outline-2">
<h2 id="orgb576a0f">Com que frequência dívidas técnicas nos softwares são criadas e pagas?</h2>
</div>
<div id="outline-container-orgf887c4c" class="outline-2">
<h2 id="orgf887c4c">Como funciona o onboarding?</h2>
</div>
<div id="outline-container-org4481859" class="outline-2">
<h2 id="org4481859">O quão sistematicamente questões relacionadas a <a href="https://pt.wikipedia.org/wiki/Doutrina">doutrina</a> da empresa são repetidas para os funcionários?</h2>
</div>
<div id="outline-container-org1449cad" class="outline-2">
<h2 id="org1449cad">O que pode fazer um funcionário ser demitido? Quais foram as causas mais comuns?</h2>
</div>
<div id="outline-container-orgff131b0" class="outline-2">
<h2 id="orgff131b0">Como é a cobrança sobre os funcionários?</h2>
</div>
<div id="outline-container-orgd8364ce" class="outline-2">
<h2 id="orgd8364ce">Como é funciona o aumento dos funcionários?</h2>
<div class="outline-text-2" id="text-orgd8364ce">
</div>
<div id="outline-container-org5a890f0" class="outline-3">
<h3 id="org5a890f0">Vocês negocioam salário caso o funcionário receba uma outra proposta?</h3>
</div>
</div>
<div id="outline-container-orgfc6b905" class="outline-2">
<h2 id="orgfc6b905">De um ano para cá, quantos funcionários sairam e quantos entraram nesta empresa?</h2>
</div>
<div id="outline-container-orgc29fc95" class="outline-2">
<h2 id="orgc29fc95">Esta empresa dá lucro? Depende de investimento externo?</h2>
</div>
</div>
</body>
</html>
